Tekla Open API Reference for Tekla Structures 2025
DistanceListConverter Methods
The DistanceListConverter type exposes the following members.
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the distance list type.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the distance list type to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the distance list type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the distance list type to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
DistanceListConverter Class
Tekla.Structures.Datatype Namespace